{  
   "count":8,
   "dinosaurs":[  
      {  
         "id":"5c82d1dccd5ab120aca0caeb",
         "name":"Eryops",
         "taxonomicOrder":"Temnospondyli",
         "species":"E. megacephalus",
         "phylum":"Chordata",
         "binomialname":"Eryops megacephalus",
         "information":"Eryops averaged a little over 1.5–2.0 metres (4.9–6.6 ft) long and could grow up to 3 metres (9.8 ft), making them among the largest land animals of their time. Adults weighed about 90 kilograms (200 lb). The skull was proportionately large, being broad and flat and reaching lengths of 60 centimetres (2.0 ft). It had an enormous mouth with many curved teeth like the frog. Its teeth had enamel with a folded pattern, leading to its early classification as a \"labyrinthodont\" (\"maze toothed\"). The shape and cross section of Eryops teeth made them exceptionally strong and resistant to stresses. The palate, or roof of the mouth, contained three pairs of backward-curved fangs, and was covered in backward-pointing bony projections which would have been used to trap slippery prey once caught. This, coupled with the wide gape, suggest an inertial method of feeding, in which the animal would grasp its prey and thrust forward, forcing the prey farther back into its mouth. Eryops is currently thought to contain only one species, E. megacephalus, which means \"large-headed Eryops\". E. megacephalus fossils have been found only in rocks dated to the early Permian period (Sakmarian age, about 295 million years ago) in the southwestern United States, primarily in the Admiral Formation of the Texas Red Beds.[5] During the mid-20th century, some older fossils were classified as a second species of Eryops, E. avinoffi. This species, known from Carboniferous period fossil found in Pennsylvania, had originally been classified in the genus Glaukerpeton. Beginning in the late 1950s, some scientists concluded that Glaukerpeton was too similar to Eyrops to deserve its own genus. However, later studies supported the original classification of Glaukerpeton, finding that it was more primitive than Eryops and some other early temnospondyls. Supposed Eryops fossils also found in older Pennsylvanian epoch rocks of the Conemaugh Group in West Virginia also turned out to be remains of Glaukerpeton.In 2005, a skull clearly belonging to Eryops was found in upper Pennsylvanian epoch rocks of the El Cobre Canyon Formation in New Mexico, representing the oldest known specimen.",
         "era":"Early Permian (about 295 million years ago)",
         "imageUrl":"http://gdurl.com/SFoS"
      },
      {  
         "id":"5c82d4e0cd5ab120aca0caec",
         "name":"Mosasaur",
         "taxonomicOrder":"Squamata",
         "species":"Mosasauroidea",
         "phylum":"Chordata",
         "binomialname":"Mosasauridae Gervais",
         "information":"Mosasaurs breathed air, were powerful swimmers, and were well-adapted to living in the warm, shallow inland seas prevalent during the Late Cretaceous period. Mosasaurs were so well adapted to this environment that they gave birth to live young, rather than returning to the shore to lay eggs as sea turtles do. The smallest-known mosasaur was Dallasaurus turneri, which was less than 1 m (3.3 ft) long. Larger mosasaurs were more typical, with many species growing longer than 4 m (13 ft). Mosasaurus hoffmannii, the largest known species, may have reached up to 17 m (56 ft) in length.[3] Currently, the largest publicly exhibited mosasaur skeleton in the world is on display at the Canadian Fossil Discovery Centre in Morden, Manitoba. The specimen, nicknamed \"Bruce\", is just over 13 m (43 ft) long. Mosasaurs had a body shape similar to that of modern-day monitor lizards (varanids), but were more elongated and streamlined for swimming. Their limb bones were reduced in length and their paddles were formed by webbing between their long finger and toe bones. Their tails were broad, and supplied their locomotive power. Until recently, mosasaurs were assumed to have swum in a method similar to the one used today by conger eels and sea snakes, undulating their entire bodies from side to side. However, new evidence suggests that many advanced mosasaurs had large, crescent-shaped flukes on the ends of their tails, similar to those of sharks and some ichthyosaurs. Rather than use snake-like undulations, their bodies probably remained stiff to reduce drag through the water, while their tails provided strong propulsion. These animals may have lurked and pounced rapidly and powerfully on passing prey, rather than chasing after it.",
         "era":"Early Cretaceous, somewhere in the last 20 million years of the Cretaceous period (Turonian-Maastrichtian ages)",
         "imageUrl":"http://gdurl.com/Zdzj"
      },
      {  
         "id":"5c82e2b6cd5ab120aca0caed",
         "name":"Flexicalymene",
         "taxonomicOrder":"Phacopida",
         "species":"F. croneisi",
         "phylum":"Arthropoda",
         "binomialname":"F. meeki",
         "information":"Flexicalymene is a genus of trilobites of the order Phacopida, suborder Calymenina. They are found abundantly in North America. Flexicalymene specimens can be mistaken for Calymene, Gravicalymene, Diacalymene and a few other Calymenina genera. They are used as an index fossil in the Ordovician. Ohio and North America are particularly known for being rich with Flexicalymene fossils. Species include F. meeki and F. retrorsa (Ohio, Kentucky and Indiana), F. granulosa (Ohio, Kentucky and Quebec), F. senaria (Quebec, Vermont, and New York) and F. croneisi (Ontario).",
         "era":"Flexicalymene is an order of trilobite that lived from the Late Cambrian to the Late Devonian",
         "imageUrl":"http://gdurl.com/CJsVG"
      },
      {  
         "id":"5c82eb3ecd5ab120aca0caf3",
         "name":"Megalodon",
         "taxonomicOrder":"Lamniformes",
         "species":"C. megalodon",
         "phylum":"Chordata",
         "binomialname":"Carcharocles megalodon",
         "information":"Megalodon (Carcharocles megalodon), meaning \"big tooth\", is an extinct species of shark that lived approximately 23 to 3.6 million years ago (mya), during the Early Miocene to the end of the Pliocene. It was formerly thought to be a member of the family Lamnidae, making it closely related to the great white shark (Carcharodon carcharias). However presently there is near unanimous consensus that it belongs to the extinct family Otodontidae, which diverged from the ancestry of the great white shark during the Early Cretaceous. Its genus placement is still debated, authors placing it in either Carcharocles, Megaselachus, Otodus, or Procarcharodon. Scientists suggest that megalodon looked like a stockier version of the great white shark, though some experts believe it may have looked similar to the basking shark (Cetorhinus maximus) or the sand tiger shark (Carcharias taurus). Regarded as one of the largest and most powerful predators to have ever lived, fossil remains of megalodon suggest that this giant shark reached a maximum length of 18 meters (59 ft) with the average size being 10.5 meters (34 ft). Their large jaws could exert a bite force of up to 110,000 to 180,000 newtons (25,000 to 40,000 lb). Their teeth were thick and robust, built for grabbing prey and breaking bone. Megalodon probably had a major impact on the structure of marine communities. The fossil record indicates that it had a cosmopolitan distribution. It probably targeted large prey, such as whales, seals, and sea turtles. Juveniles inhabited warm coastal waters and fed on fish and small whales. Unlike the great white, which attacks prey from the soft underside, megalodon probably used its strong jaws to break through the chest cavity and puncture the heart and lungs of its prey. The animal faced competition from whale-eating cetaceans, such as Livyatan and other macroraptorial sperm whales, and smaller ancestral killer whales such as Orcinus citoniensis. As the shark preferred warmer waters, it is thought that oceanic cooling associated with the onset of the ice ages, coupled with the lowering of sea levels and resulting loss of suitable nursery areas, may have also contributed to its decline. A reduction in the diversity of baleen whales and a shift in their distribution toward polar regions may have reduced megalodon's primary food source. More recently, evidence has come forward that competition from the modern great white shark may have also contributed to the extinction of megalodon, coupled with range fragmentation resulting in a gradual, asynchronous extinction as a result of cooling oceans around 3.6-4 million years ago, far earlier than previously assumed The extinction of the shark appeared to affect other animals; for example, the size of baleen whales increased significantly after the shark had disappeared.",
         "era":"Megalodon is an extinct species of shark that lived approximately 23 to 3.6 million years ago (mya), during the Early Miocene to the end of the Pliocene.",
         "imageUrl":"http://gdurl.com/PnLG"
      },
      {  
         "id":"5c82ec80cd5ab120aca0caf4",
         "name":"Pentremites",
         "taxonomicOrder":"Spiraculata",
         "species":"Pentremites godoni",
         "phylum":"Echinodermata",
         "binomialname":"Pentremites g.",
         "information":"These echinoderms averaged a height of about 11 centimetres (4.3 in) but occasionally ranged up to about 3 times that size. They, like other blastoids, superficially resemble their distant relatives, the crinoids or sea lilies, having a near-identical lifestyle living on the sea floor attached by a stalk. They trapped food floating in the currents by means of tentacle-like appendages.",
         "era":"Pentremites species lived in the early to middle Carboniferous, from 360.7 to 314.6 Ma.",
         "imageUrl":"http://gdurl.com/KPY9"
      },
      {  
         "id":"5c86c9012f7d2718ea2c1c7d",
         "name":"Triceratops",
         "taxonomicOrder":"Ornithischia",
         "species":"Ceratops horridus",
         "phylum":"Chordata",
         "binomialname":"T. horridus",
         "information":"Triceratops is a genus of herbivorous ceratopsid dinosaur that first appeared during the late Maastrichtian stage of the late Cretaceous period, about 68 million years ago (mya) in what is now North America. It is one of the last known non-avian dinosaur genera, and became extinct in the Cretaceous–Paleogene extinction event 66 million years ago. The name Triceratops, which literally means \"three-horned face\". Individual Triceratops are estimated to have reached about 7.9 to 9.0 m (25.9–29.5 ft) in length, 2.9 to 3.0 m (9.5 to 9.8 ft) in height, and 6.1–12.0 tonnes (13,000–26,000 lb) in weight. The most distinctive feature is their large skull, among the largest of all land animals. The largest known skull (specimen MWC 7584, formerly BYU 12183) is estimated to have been 2.5 metres (8.2 ft) in length when complete,[9] and could reach almost a third of the length of the entire animal. A specimen of T. horridus named Kelsey measured 7.3 metres (24 ft) long with a 1.98 metres (6.5 ft) skull, stood about 2.3 metres (7.5 ft) tall, and was estimated by the Black Hills institute to weight nearly 6 tonnes (5.9 long tons; 6.6 short tons). A Triceratops 8 metres (26 ft) long has been estimated by Gregory S. Paul to have massed 9.3 tonnes (9.2 long tons; 10.3 short tons). It bore a single horn on the snout, above the nostrils, and a pair of horns approximately 1 m (3.3 ft) long, with one above each eye.",
         "era":"Triceratops  first appeared during the late Maastrichtian stage of the late Cretaceous period, about 68 million years ago (mya) in what is now North America.",
         "imageUrl":"http://gdurl.com/GN6c"
      },
      {  
         "id":"5c86cc2e2f7d2718ea2c1c7e",
         "name":"Protungulatum",
         "taxonomicOrder":"Eutheria",
         "species":"P. donnae",
         "phylum":"Chordata",
         "binomialname":"P. sloani",
         "information":"Protungulatum ('first ungulate') is an extinct genus of mammal first found in the Bug Creek Anthills in northeastern Montana. The Bug Creek Anthills were initially believed to be Late Cretaceous (latest Maastrichtian) because of the presence of the remains of non-avian dinosaurs and common Cretaceous mammals, but these were later shown to have been reworked from Late Cretaceous strata, and consequently the Bug Creek Anthills are currently believed to be Early Paleocene (Puercan) in age. Remains from the Ravenscrag Formation of Saskatchewan, Canada have been assigned to P. donnae. These remains may also be Cretaceous in age, but the age of the Ravenscrag Formation is not entirely certain. In 2011, remains of a new species of Protungulatum, P. coombsi, from the Hell Creek Formation, which is definitely Late Cretaceous (Maastrichtian) in age, proved that Protungulatum was present in both the Cretaceous and the Paleocene. It was initially assigned to the order condylarthra, a group of archaic \"ungulates\", that is now known to be polyphyletic. According to Archibald et al. (2011), Protungulatum is not even definitely a placental mammal. Some studies have found it to be close to Cetartiodactyla, but the most recent analysis helds it to be a non-placental eutherian.",
         "era":"Protungulatum believed to be Early Paleocene (Puercan) in age",
         "imageUrl":"http://gdurl.com/xASg"
      },
      {  
         "id":"5c86cd5d2f7d2718ea2c1c7f",
         "name":"Quetzalcoatlus",
         "taxonomicOrder":"Pterosauria",
         "species":"Quetzalcoatlus northropi",
         "phylum":"Chordata",
         "binomialname":"Q.  Northropi",
         "information":"Quetzalcoatlus northropi is a pterosaur known from the Late Cretaceous of North America (Maastrichtian stage) and one of the largest-known flying animals of all time. It is a member of the family Azhdarchidae, a family of advanced toothless pterosaurs with unusually long, stiffened necks. Its name comes from the Mesoamerican feathered serpent god, Quetzalcoatl. When it was first named as a new species in 1975, scientists estimated that the largest Quetzalcoatlus fossils came from an individual with a wingspan as large as 15.9 m (52 ft). Choosing the middle of three extrapolations from the proportions of other pterosaurs gave an estimate of 11 m, 15.5 m, and 21 m, respectively (36 ft, 50.85 ft, 68.9 ft). In 1981, further advanced studies lowered these estimates to 11–12 m (36–39 ft). Comparison of Q. northropi with a Cessna 172 light aircraft. More recent estimates based on greater knowledge of azhdarchid proportions place its wingspan at 10–11 m (33–36 ft). Remains found in Texas in 1971 indicate that this reptile had a minimum wingspan of about 11 m (36 ft). Generalized height in a bipedal stance, based on its wingspan, would have been at least 3 m (9.8 ft) high at the shoulder.",
         "era":"Quetzalcoatlus is known from the Late Cretaceous of North America (Maastrichtian stage) and one of the largest-known flying animals of all time.",
         "imageUrl":"http://gdurl.com/vlhh"
      }
   ]
}